# GetPanelScheduleType Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
PanelScheduleTemplate..::..GetPanelScheduleType Method
PanelScheduleTemplate Class See Also
---
Returns the panel schedule type.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public PanelScheduleType GetPanelScheduleType()
```

Visual Basic
---
```text
Public Function GetPanelScheduleType As PanelScheduleType
```

Visual C++
---
```text
public:
PanelScheduleType GetPanelScheduleType()
```

# See Also
PanelScheduleTemplate Class
Autodesk.Revit.DB.Electrical Namespace